# 정수 x가 주어질 때 사용할 수 있는 연산은 4가지
'''
1. x가 5로 나누어떨어지면 5로나눈다
2. x가 3로 나누어떨어지면 3로나눈다
3. x가 2로 나누어떨어지면 2로나눈다
4. x에서 1을 뺀다

'''
# 4개의 연산을 적절히 이용해서 1을 만들려고 할때 필요한 연산의 최솟값 구하기

# ====================
# 점화식 => An = min(An-1,An/2,An/3,An/5) + 1
# 정수 X를 입력 받기
x = int(input())

# 앞서 계산된 결과를 저장하기 위한 DP 테이블 초기화
d = [0] * 1000001

# 다이나믹 프로그래밍(Dynamic Programming) 진행(보텀업)
for i in range(2, x + 1):
    # 현재의 수에서 1을 빼는 경우
    d[i] = d[i - 1] + 1
    # 현재의 수가 2로 나누어 떨어지는 경우
    if i % 2 == 0:
        d[i] = min(d[i], d[i // 2] + 1)
    # 현재의 수가 3으로 나누어 떨어지는 경우
    if i % 3 == 0:
        d[i] = min(d[i], d[i // 3] + 1)
    # 현재의 수가 5로 나누어 떨어지는 경우
    if i % 5 == 0:
        d[i] = min(d[i], d[i // 5] + 1)

print(d[x])
